# Melakukan coloum selection bedasarkan tipe data

In [1]:
import pandas as pd
import numpy as np

print (pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [4]:
#Persiapan data Frame
n_rows=5
n_cols=2
cols=['bil_pecahan','bil_bulat']

df=pd.DataFrame(np.random.randint(1, 20, size=(n_rows,n_cols)),columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')
#makeDateIndex membuat data dalam bentuk waktu 
df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()#membuat index baru 

df['nilai']=list('ABCDE')#menambahkan kolom terakhir 

df

                index  bil_pecahan  bil_bulat nilai
0 2000-01-01 00:00:00         19.0          9     A
1 2000-01-01 01:00:00          8.0         10     B
2 2000-01-01 02:00:00          4.0          1     C
3 2000-01-01 03:00:00          9.0         12     D
4 2000-01-01 04:00:00         17.0         16     E

In [5]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
nilai                  object
dtype: object

In [6]:
#Memilih kolom bertipe data numerik
df.select_dtypes(include='number')#memilih kolom yang numerik saja

   bil_pecahan  bil_bulat
0         19.0          9
1          8.0         10
2          4.0          1
3          9.0         12
4         17.0         16

In [7]:
df.select_dtypes(include='float')#Tipe data flooat yang muncul

   bil_pecahan
0         19.0
1          8.0
2          4.0
3          9.0
4         17.0

In [8]:
df.select_dtypes(include='int')

   bil_bulat
0          9
1         10
2          1
3         12
4         16

In [9]:
df.select_dtypes(include='object')#tipe data string

  nilai
0     A
1     B
2     C
3     D
4     E

In [10]:
df.select_dtypes(include='datetime') #menampilkan data waktu

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [11]:
df.select_dtypes(include=['number','object'])# menampilkan 2 kombonasi seperti basis data

   bil_pecahan  bil_bulat nilai
0         19.0          9     A
1          8.0         10     B
2          4.0          1     C
3          9.0         12     D
4         17.0         16     E